#include <iostream>

int main()
{
	/*
			
		(1)	-	1 / 1	
		(2)	-	1 / 2	(3)	-	2 / 1	
		(4)	-	3 / 1	(5)	-	2 / 2	(6)	-	1 / 3
		(7)	-	1 / 4	(8)	-	2 / 3	(9)	-	3 / 2	(10)-	4 / 1
		(11)-	5 / 1	(12)-	4 / 2	(13)-	3 / 3	(14)-	2 / 4	(15)-	1 / 5

		─────────────────────────────────────────────────────────────────────────────
		n * (n + 1) / 2

		row = 1;
		x = 8;
		3행 5행 사이
		3 * (3 + 1) / 2 < x <= 5 * (5 + 1) / 2
		6 < x <= 15

		while (bCheck)
		{
			if (((row - 1) * (row - 1 + 1) / 2 < x ) && ( x <= (row) * (row + 1) / 2))
				bCheck = true;
			else
			{	bCheck = false;
				row++;
			}
		}

		─────────────────────────────────────────────────────────────────────────────
		분모 + 분자 = 행 + 1

		홀수행 : 분자 - 1, 분모 + 1
		짝수행 : 분자 + 1, 분모 - 1
	*/

	int x = 0;
	int row = 1, num = 0;
	bool bCheck = true;

	std::cin >> x;
	while (bCheck)
	{
		if (((row - 1) * (row - 1 + 1) / 2 < x) && (x <= (row) * (row + 1) / 2))
			bCheck = false;	// 몇번 째 행인지 찾았을 때 
		else
		{
			bCheck = true;	// 찾지 못했을 때
			row++;
		}
	}

	num = row * (row + 1) / 2;

	if (row % 2 != 0)
	{	
		// 홀수 일때
		std::cout << num - x + 1 << "/" << row - (num - x);
	}
	else if (row % 2 == 0)
	{
		// 짝수 일때
		std::cout << row - (num - x) << "/" << num - x + 1;
	}

	return 0;
}